#include <stdio.h>

int main() {
	int P1, P2, P3;
	int Num;
	
	int M_5000 = 0, M_1000 = 0, M_500 = 0, M_100 = 0, M_50 = 0, M_10 = 0;
	
	printf("세 개의 물건값을 입력하세요 : ");
	scanf("%d %d %d", &P1, &P2, &P3);
	
	Num = 10000-(P1+P2+P3);
	
	printf("거스름돈은 %d원입니다.\n", Num);
	
	
	
	int i;

	
	M_5000 = Num/5000;
	M_1000 = (Num - (5000*M_5000)) / 1000;
	M_500 = (Num - (5000*M_5000) - (1000*M_1000)) / 500;
	M_100 = (Num - (5000*M_5000) - (1000*M_1000) - (500*M_500)) / 100;
	M_50 = (Num - (5000*M_5000) - (1000*M_1000) - (500*M_500) - (100*M_100)) / 50;
	M_10 = (Num - (5000*M_5000) - (1000*M_1000) - (500*M_500) - (100*M_100) - (50*M_50)) / 10;
	
	
	printf("오천원권: %d장\n", M_5000);
	printf("천원권: %d장\n", M_1000);
	printf("오백원짜리 동전: %d개\n", M_500);
	printf("백원짜리 동전: %d개\n", M_100);
	printf("오십원짜리 동전: %d개\n", M_50);
	printf("십원짜리 동전: %d개\n", M_10);

}
